Autodesk.Revit.DB.Structure.AnalyticalCurveType
Identifies what type of Analytical Model curves should be extracted.

Autodesk.Revit.DB.Structure.AnalyticalCurveType.AllRigidLinks
All Rigid Link curves.
Rigid Link at end 0 (head) will be in the first entry.
Rigid Link at end 1 (tail) will be in the last entry.

Autodesk.Revit.DB.Structure.AnalyticalCurveType.BaseCurve
Default Analytical Model curve of linear elements (beams, braces, columns).

Autodesk.Revit.DB.Structure.AnalyticalCurveType.ApproximatedCurves
Curves approximated using linear segments.

Autodesk.Revit.DB.Structure.AnalyticalCurveType.ActiveCurves
Curves displayed on screen (not including Rigid Links).

Autodesk.Revit.DB.Structure.AnalyticalCurveType.RigidLinkTail
Rigid Link at end 1 (tail) of the Beam.

Autodesk.Revit.DB.Structure.AnalyticalCurveType.RigidLinkHead
Rigid Link at end 0 (head) of the Beam.

Autodesk.Revit.DB.Structure.AnalyticalCurveType.RawCurves
Base Analytical Model curves generated.